In [1]:
#loading the libraries

import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading the dataset, puting in a dataframe and checking first 5 rows

dataset = load_dataset("lukebarousse/data_jobs")
df =dataset['train'].to_pandas()
df.head()

#cleaning the data
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [48]:
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [9]:
#let calculate the median salary_year_avg and salary_hour_avg
median_salary_year = df['salary_year_avg'].median()

In [10]:
median_salary_hour = df['salary_hour_avg'].median()

In [ ]:
#filling the missing values with the median

df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [ ]:
#check and see if the data is filled

df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [49]:
#remving duplicate rows
df_unique = df_unique.drop_duplicates()

#checking how many rows were removed

print('length of the original dataset:', len(df_filled))
print('length of the cleaned dataset:', len(df_unique))
print('Rows dropped:', len(df_filled) - len(df_unique))

length of the original dataset: 785741
length of the cleaned dataset: 508042
Rows dropped: 277699

In [50]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

#checking how many rows were removed
print('length of the original df:', len(df_filled))
print('length of the cleaned df:', len(df_unique))
print('Rows dropped:', len(df_filled) - len(df_unique))

length of the original df: 785741
length of the cleaned df: 508042
Rows dropped: 277699